{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"padding": "valid", "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "batch_input_shape": [null, 64, 64, 1], "strides": [1, 1], "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_1", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "filters": 32, "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 32, "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "relu", "units": 128, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "softmax", "units": 6, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.2.2"}